content-org/all-posts.org
#+title: Hammond's Blog And Class Posts
#+hugo_base_dir: ../
#+MACRO: more @@hugo:<!--more-->@@
#   to use this one, write {{{more}}}
#+MACRO: youtube @@hugo:{{< youtube id="$1" >}}@@
#  to use this, write {{{youtube(ID)}}}
#+hugo_paired_shortcodes: spoiler
#  to use this, write:
#     #+begin_spoiler
#      You need to click to see this, my friend.
#     #+end_spoiler

** Week 6
:PROPERTIES:
:EXPORT_FILE_NAME: Week6
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :ShowBreadCrumbs true
:END:

Your todo list for the week
{{{more}}}

*** Solutions to checkpoint 5
[[https://nextcloud.math.wichita.edu/index.php/s/YEqHHKcCGHsKwG3][Here's the solutions.]]

[[https://nextcloud.math.wichita.edu/index.php/s/aFXtNNd9Heb2tQC][Here's the original file]]

*** Before class on Tuesday
:PROPERTIES:
:CUSTOM_ID: before-class-on-tuesday-12
:END:
(No pre-class material, but still live class)

**** 📚 Read / Watch
:PROPERTIES:
:CUSTOM_ID: read-watch-9
:END:
(buffer, no-pre-class, but still live class)

**** 📝 Homework
:PROPERTIES:
:CUSTOM_ID: homework-19
:END:
- Required: Do all the exercises at the bottom of each section, check
  your answers and check your understanding - please as questions if
  you're unsure!
- (optional): Practice additional exercises in the supplemental
  textbooks if you need/want:
  [[http://discrete.openmathbooks.org/dmoi3/][DMOI]] and
  [[http://faculty.uml.edu/klevasseur/ads/index-ads.html][Applied
  Discrete Structures]].

**** Questions?
:PROPERTIES:
:CUSTOM_ID: questions-16
:END:
Ask it on Discourse, and let's get it answered!

--------------

*** 🎥 Tuesday recitation
:PROPERTIES:
:CUSTOM_ID: tuesday-recitation-12
:END:
{{{youtube(zYH5QNNymTY)}}}

--------------

*** Before Class on Thursday
:PROPERTIES:
:CUSTOM_ID: before-class-on-thursday-11
:END:
**** 📚 Readings / Videos
:PROPERTIES:
:CUSTOM_ID: readings-videos-10
:END:
- [[https://www.math.wichita.edu/~hammond/class-notes/section-primes.html][Primes]]
- [[https://www.math.wichita.edu/~hammond/class-notes/section-gcd-euclid.html][GCDs and the Euclidean Algorithm]]

**** 📝 Homework
:PROPERTIES:
:CUSTOM_ID: homework-20
:END:
- Required: Do all the exercises at the bottom of each section, check
  your answers and check your understanding - please as questions if
  you're unsure!
- (optional): Practice additional exercises in the supplemental
  textbooks if you need/want:
  [[http://discrete.openmathbooks.org/dmoi3/][DMOI]] and
  [[http://faculty.uml.edu/klevasseur/ads/index-ads.html][Applied
  Discrete Structures]].

**** Questions?
:PROPERTIES:
:CUSTOM_ID: questions-17
:END:
Ask it on Discourse, and let's get it answered!

--------------

*** 🎥 Thursday recitation
:PROPERTIES:
:CUSTOM_ID: thursday-recitation-11
:END:
{{{youtube(oRijFjqgyrU)}}}

