content/math321/Week6.md
+++
title = "Week 6"
author = ["John Hammond"]
draft = false
ShowBreadCrumbs = true
+++

Your todo list for the week
<!--more-->


## Solutions to checkpoint 5 {#solutions-to-checkpoint-5}

[Here's the solutions.](https://nextcloud.math.wichita.edu/index.php/s/JnEGAx6cZodtssq)

[Here's the original file](https://nextcloud.math.wichita.edu/index.php/s/wFqaBKkDbW4YWbB)


## Before class on Tuesday {#before-class-on-tuesday-12}

(No pre-class material, but still live class)


### 📚 Read / Watch {#read-watch-9}

(buffer, no-pre-class, but still live class)


### 📝 Homework {#homework-19}

-   Required: Do all the exercises at the bottom of each section, check
    your answers and check your understanding - please as questions if
    you're unsure!
-   (optional): Practice additional exercises in the supplemental
    textbooks if you need/want:
    [DMOI](http://discrete.openmathbooks.org/dmoi3/) and
    [Applied
    Discrete Structures](http://faculty.uml.edu/klevasseur/ads/index-ads.html).


### Questions? {#questions-16}

Ask it on Discourse, and let's get it answered!

---


## 🎥 Tuesday recitation {#tuesday-recitation-12}

**TO BE POSTED**

---


## Before Class on Thursday {#before-class-on-thursday-11}


### 📚 Readings / Videos {#readings-videos-10}

-   [Primes](https://www.math.wichita.edu/~hammond/class-notes/section-primes.html)
-   [GCDs and the Euclidean Algorithm](https://www.math.wichita.edu/~hammond/class-notes/section-gcd-euclid.html)


### 📝 Homework {#homework-20}

-   Required: Do all the exercises at the bottom of each section, check
    your answers and check your understanding - please as questions if
    you're unsure!
-   (optional): Practice additional exercises in the supplemental
    textbooks if you need/want:
    [DMOI](http://discrete.openmathbooks.org/dmoi3/) and
    [Applied
    Discrete Structures](http://faculty.uml.edu/klevasseur/ads/index-ads.html).


### Questions? {#questions-17}

Ask it on Discourse, and let's get it answered!

---


## 🎥 Thursday recitation {#thursday-recitation-11}

**TO BE POSTED**
